"""
Довести до ладу для решти кейсів
Подумати куди і як зберігати отримані результати
"""

import re

import requests
from bs4 import BeautifulSoup

import pandas as pd


def rz(name: str) -> pd.DataFrame:
    """ Отримує табл. род. зв. у максимально наближеному
    до шаблона вигляді. 

    name: ім'я судді у форматі: Прізвище Ім'я По-батькові
    ---

    >>> rz(name)
                             ПІБ               Місце роботи                     Посада Період роботи
    0  Іванов Іван Іванович       Оперативне управління ДПІ  cтарший оперуповноважений  2015—2016 рр.
    1                             Оперативне управління ГУ   cтарший оперуповноважений  2016—2018 рр.
    2  Іванов НеІван Іванович     Державна Екологічна Інспе  головний спеціаліст відді  2012—2018 рр.
    3  НеІванов Неіван Неіваночи  Долинське відділення полі  поліцейський сектору реаг  2017—2017 рр.
    4                                                        інспектор з ювенальної пр  2017—2018 рр.
    """

    pib = re.sub("\s+", "-", name).lower()

    # url = "http://blood.in.ua/declaration/прізвище-імя-побатькові"
    url = "http://blood.in.ua/declaration/"
    response = requests.get(url + pib)
    soup = BeautifulSoup(response.text, "html.parser")

    # отримую все, крім посади; 
    df = pd.read_html(soup.prettify())[0]
    df.columns = ["ПІБ", "Місце роботи", "Початок роботи", "Кінець роботи"]

    # посада за `em` тегом
    df["Посада"] = [em.text for em in soup.find_all("em")]

    # оскільки спочатку колонка місця роботи містить як саме місце роботи, так і посаду,
    # прибираю з неї збіг із колонкою посади
    df["Місце роботи"] = df["Місце роботи"].str.replace("|".join(df["Посада"]), "")

    # шукаю індекс, за якого у колонці місця роботи вказана посада
    idx = df.loc[df["Місце роботи"].str.strip().eq(df["Посада"].str.strip())].index

    # # замінити місцем роботи з колонки вгорі
    # df.loc[idx,'Місце роботи'] = df.loc[idx-1, :]['Місце роботи'].values

    # # або порожнім значенням
    df.loc[idx, "Місце роботи"] = ""

    # замінити друге підряд однакове ПІБ порожнім значенням
    df.loc[df["ПІБ"].shift(1).eq(df["ПІБ"]), "ПІБ"] = ""

    # до тих ПІБ, що лишились, додати символ em dash в кінець
    df.loc[df["ПІБ"].ne(""), "ПІБ"] = df["ПІБ"] + " —"

    # об'єднати дати початку та кінця роботи в одну колонку
    df["Період роботи"] = df["Початок роботи"].str.cat(df["Кінець роботи"], sep="-")

    # з об'єднаної колонки отримали роки початку та кінця, об'єднати та дописати ' рр.'
    df["Період роботи"] = (
        df["Період роботи"].str.findall("(\d{4})").apply("—".join) + " рр."
    )

    return df[["ПІБ", "Місце роботи", "Посада", "Період роботи"]]


if __name__ == "__main__":
    name = "Іванов Іван Іванович"
    df = rz(name)
